my_string=input('Введите произвольную строку: ')
print('Длина Вашей строки: '+str(len(my_string))+' символов')
print('Ваша строка в ВЕРХНЕМ РЕГИСТРЕ: '+my_string.upper())
print('Ваша строка в нижнем регистре: '+my_string.lower())
print('Ваша строка без пробелов: '+my_string.replace(' ', ''))
print('Первый символ Вашей строки: "'+my_string[0]+'"')
print('Последний символ Вашей строки: "'+my_string[-1]+'"')

#Создайте переменную my_string и присвойте ей значение строки с произвольным текстом (функция input()).
#Вывести количество символов введённого текста
#3. Работа с методами строк:
#
#Используя методы строк, выполните следующие действия:
#
#Выведите строку my_string в верхнем регистре.
#Выведите строку my_string в нижнем регистре.
#Измените строку my_string, удалив все пробелы.
#Выведите первый символ строки my_string.
#Выведите последний символ строки my_string.
#Примечания:
#
#Для вывода значений на экран используйте функцию print().
#Для вызова методов строк используйте операцию точки '.'.
#Дополнительно о всех методах строк можно узнать здесь.